# SQL Connector

* Libraries to install before use:

```
!pip install mysql
!pip install mysql-connector-python-rf
!pip install pymysql
```

Though, the most effective one will be the last one.

In [1]:
# Importing Libraries
import pymysql as db
import pandas as pd

In [2]:
# DB Details
localhost = '127.0.0.1'
user = 'root'
password = 'root'
database = 'practice'

In [3]:
# DB Connection
conn = db.connect(host = localhost,
                  port = 3306,
                  user = user,
                  passwd = password,
                  db = database
                 )

In [4]:
# SQL Query
query = 'SELECT * FROM flights;'

In [5]:
# Reading in the as DataFrame
df = pd.read_sql_query(query, conn)
df.head()

,id,name,alias,iata,icao,callsign,country,active
0,1,Private flight,None,-,,,,Y
1,2,135 Airways,None,,GNL,GENERAL,United States,N
2,3,1Time Airline,None,1T,RNX,NEXTIME,South Africa,Y
3,4,2 Sqn No 1 Elementary Flying Training School,None,,WYT,,United Kingdom,N
4,5,213 Flight Unit,None,,TFU,,Russia,N

# End